### Terraform Plan - `k8s-cluster` - Development 🪐
- Terraform Format and Style 🖌: `success`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary><b>Show Plan</b></summary>

```terraform azurerm_resource_group.default: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourceGroups/feyrek8s-dev-rg]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourceGroups/feyrek8s-dev-rg/providers/Microsoft.ContainerRegistry/registries/feyrek8sacrdev]
azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourcegroups/feyrek8s-dev-rg/providers/Microsoft.ContainerService/managedClusters/feyrek8s-dev-aks]
azurerm_role_assignment.acrpull_role: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourceGroups/feyrek8s-dev-rg/providers/Microsoft.ContainerRegistry/registries/feyrek8sacrdev/providers/Microsoft.Authorization/roleAssignments/263ffe01-8371-b224-18ba-70ffdf2ac621]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/k8s-cluster`, Workflow: `deployment`

### Terraform Plan - `k8s` - Development 🪐
- Terraform Format and Style 🖌: `success`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary><b>Show Plan</b></summary>

```terraform module.frontend.kubectl_manifest.frontend_namespace[0]: Refreshing state... [id=/api/v1/namespaces/frontend]
module.backend.kubectl_manifest.backend_namespace[0]: Refreshing state... [id=/api/v1/namespaces/backend]
module.backend.kubectl_manifest.backend_service[0]: Refreshing state... [id=/api/v1/namespaces/backend/services/backend]
module.frontend.kubectl_manifest.frontend_secret[0]: Refreshing state... [id=/api/v1/namespaces/frontend/secrets/frontend-secret]
module.backend.kubectl_manifest.backend_deployment[0]: Refreshing state... [id=/apis/apps/v1/namespaces/backend/deployments/backend]
module.frontend.kubectl_manifest.frontend_deployment[0]: Refreshing state... [id=/apis/apps/v1/namespaces/frontend/deployments/frontend]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.frontend.kubectl_manifest.frontend_deployment[0] has been changed
  ~ resource "kubectl_manifest" "frontend_deployment" {
        id                      = "/apis/apps/v1/namespaces/frontend/deployments/frontend"
      ~ live_manifest_incluster = (sensitive value)
      ~ live_resource_version   = "230732" -> "339022"
        name                    = "frontend"
        # (13 unchanged attributes hidden)
    }
  # module.backend.kubectl_manifest.backend_deployment[0] has been changed
  ~ resource "kubectl_manifest" "backend_deployment" {
        id                      = "/apis/apps/v1/namespaces/backend/deployments/backend"
      ~ live_manifest_incluster = (sensitive value)
      ~ live_resource_version   = "328541" -> "341839"
        name                    = "backend"
        # (13 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.backend.kubectl_manifest.backend_deployment[0] will be updated in-place
  ~ resource "kubectl_manifest" "backend_deployment" {
        id                      = "/apis/apps/v1/namespaces/backend/deployments/backend"
        name                    = "backend"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                name: backend
              name: backend
              namespace: backend
            spec:
              replicas: 2
              selector:
                matchLabels:
                  name: backend
              template:
                metadata:
                  labels:
                    name: backend
                spec:
                  containers:
                  - args:
                    - setup.py
                    - -s
                    - backend
                    command:
                    - python3
          -         image: feyrek8sacrdev.azurecr.io/backend:714ad3a8
          +         env:
          +         - name: REDIS_PASSWORD
          +           valueFrom:
          +             secretKeyRef:
          +               key: REDIS_PASSWORD
          +               name: backend-secret
          +         - name: MONGO_URI
          +           valueFrom:
          +             secretKeyRef:
          +               key: MONGO_URI
          +               name: backend-secret
          +         - name: DB_BYPASS
          +           value: "True"
          +         image: feyrek8sacrdev.azurecr.io/backend:46dd25ba
                    imagePullPolicy: Always
                    name: backend
                    ports:
                    - containerPort: 80
                    resources:
                      limits:
                        cpu: "0.5"
                        memory: 500Mi
                      requests:
                        cpu: "0.25"
                        memory: 50Mi
        EOT
      ~ yaml_incluster          = (sensitive value)
        # (12 unchanged attributes hidden)
    }

  # module.backend.kubectl_manifest.backend_secret[0] will be created
  + resource "kubectl_manifest" "backend_secret" {
      + api_version             = "v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Secret"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "backend-secret"
      + namespace               = "backend"
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: backend-secret
              namespace: backend
            type: Opaque
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.frontend.kubectl_manifest.frontend_deployment[0] will be updated in-place
  ~ resource "kubectl_manifest" "frontend_deployment" {
        id                      = "/apis/apps/v1/namespaces/frontend/deployments/frontend"
        name                    = "frontend"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                name: frontend
              name: frontend
              namespace: frontend
            spec:
              replicas: 1
              selector:
                matchLabels:
                  name: frontend
              template:
                metadata:
                  labels:
                    name: frontend
                spec:
                  containers:
                  - args:
                    - app.js
                    command:
                    - node
                    env:
                    - name: DISCORD_TOKEN
                      valueFrom:
                        secretKeyRef:
                          key: DISCORD_TOKEN
                          name: frontend-secret
                    - name: ENVIRONMENT
                      value: dev
          -         image: feyrek8sacrdev.azurecr.io/frontend:714ad3a8
          +         image: feyrek8sacrdev.azurecr.io/frontend:46dd25ba
                    imagePullPolicy: Always
                    name: frontend
                    resources:
                      limits:
                        cpu: "0.5"
                        memory: 500Mi
                      requests:
                        cpu: "0.25"
                        memory: 50Mi
        EOT
      ~ yaml_incluster          = (sensitive value)
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ backend_image_tag  = "714ad3a8" -> "46dd25ba"
  ~ frontend_image_tag = "714ad3a8" -> "46dd25ba"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/k8s`, Workflow: `deployment`